

__author__ = 'Резникова Кристина Вячеславовна'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...

number = input("Input number for me. ")
for char in number:
	print(char)

print("Thx for it!")

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = input("Input number a ")
b = input("Input number b ")

c = a
a = b
b = c

print("Number a = ", a + " Number b = ", b)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

age = int(input("Hello! How old are you? "))

if age >= 18:
	print ("Access granted! Good luck with that resourse.")
else:
	print("Sorry. Acces denied! I think you're a little young for that, son.")