
__author__ = 'Резникова Кристина Вячеславовна'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?
# Подсказка: это значение точно есть ;)

	В переменной а что-то лежало, не важно что(число,символ),
главное что оно было не "пустым" и тип bool!
Как вариант я думаю что это 0.